In [1]:
import pandas as pd
pd.__version__

'2.3.3'

In [6]:
#Create Series
sales=pd.Series([1,4,7,8])
print("sales=\n",sales)

sales=
 0    1
1    4
2    7
3    8
dtype: int64

In [8]:
# Indexing and Slicing
sales[3]

np.int64(8)

In [9]:
sales[1:4]

1    4
2    7
3    8
dtype: int64

In [ ]:
# Attributes
sales.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
sales.values

array([1, 4, 7, 8])

In [15]:
sales.dtype

dtype('int64')

In [18]:
# Methods
sal=pd.Series([1,5,6,7,8,9,10,11])
sal.head()

0    1
1    5
2    6
3    7
4    8
dtype: int64

In [19]:
sal.tail()

3     7
4     8
5     9
6    10
7    11
dtype: int64

In [21]:
sal.sort_values()

0     1
1     5
2     6
3     7
4     8
5     9
6    10
7    11
dtype: int64

In [22]:
sal.count()

np.int64(8)

In [23]:
sal.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
dtype: bool

In [24]:
#Operations
sal+2

0     3
1     7
2     8
3     9
4    10
5    11
6    12
7    13
dtype: int64

In [25]:
sal%2

0    1
1    1
2    0
3    1
4    0
5    1
6    0
7    1
dtype: int64

In [26]:
#Missing Values
import numpy as np
salmissing=pd.Series([1,2,3,4,None,np.nan])
salmissing.isnull()

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [27]:
salmissing.fillna(0)

0    1.0
1    2.0
2    3.0
3    4.0
4    0.0
5    0.0
dtype: float64

##Pandas DataFrame

In [33]:
data=pd.DataFrame({"IQ":[100,165,50,70,90,104,56,96,78,89,98,67],"CGPA":[9,9.1,8.2,6.9,7.5,9.6,5.9,8,9,7,8,6.7],"PLACEMENT":["N","Y","Y","N","N","Y","N","Y","Y","Y","N","N"]})
print(data)

     IQ  CGPA PLACEMENT
0   100   9.0         N
1   165   9.1         Y
2    50   8.2         Y
3    70   6.9         N
4    90   7.5         N
5   104   9.6         Y
6    56   5.9         N
7    96   8.0         Y
8    78   9.0         Y
9    89   7.0         Y
10   98   8.0         N
11   67   6.7         N

In [18]:
import pandas as pd
s1 = pd.Series(data=[1,2,3,4,5],index=["a","b","c","d","e"])
s2 = pd.Series(data=[10,20,30,40,50],index=["a","b","c","d","f"])
data=pd.DataFrame({"c1":s1,"c2":s2})

In [5]:
#Attributes
data.shape

(5, 2)

In [6]:
data.columns

Index(['c1', 'c2'], dtype='object')

In [7]:
data.dtypes

c1    int64
c2    int64
dtype: object

In [ ]:
# Accessing Data
data.loc["e","c2"] #labels

np.int64(50)

In [ ]:
data.iloc[1:,0] # index

b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
Name: c1, dtype: float64

In [ ]:
# Methods
data.head()

    c1    c2
a  1.0  10.0
b  2.0  20.0
c  3.0  30.0
d  4.0  40.0
e  5.0   NaN

In [27]:
data.tail()

    c1    c2
b  2.0  20.0
c  3.0  30.0
d  4.0  40.0
e  5.0   NaN
f  NaN  50.0

In [28]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, a to f
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      5 non-null      float64
 1   c2      5 non-null      float64
dtypes: float64(2)
memory usage: 144.0+ bytes

In [29]:
data.describe()

             c1         c2
count  5.000000   5.000000
mean   3.000000  30.000000
std    1.581139  15.811388
min    1.000000  10.000000
25%    2.000000  20.000000
50%    3.000000  30.000000
75%    4.000000  40.000000
max    5.000000  50.000000

In [33]:
data.sort_values("c2")

    c1    c2
a  1.0  10.0
b  2.0  20.0
c  3.0  30.0
d  4.0  40.0
f  NaN  50.0
e  5.0   NaN

In [34]:
data.count()

c1    5
c2    5
dtype: int64

In [35]:
data.isnull()

      c1     c2
a  False  False
b  False  False
c  False  False
d  False  False
e  False   True
f   True  False

In [40]:
# Filtering
data[data['c1']>=4]

    c1    c2
d  4.0  40.0
e  5.0   NaN

In [44]:
# Adding, Updating, Deleting
data["tipss"]=[1,34,56,None,None,None]
data

    c1    c2  tipss
a  1.0  10.0    1.0
b  2.0  20.0   34.0
c  3.0  30.0   56.0
d  4.0  40.0    NaN
e  5.0   NaN    NaN
f  NaN  50.0    NaN

In [8]:
import pandas as pd
s1 = pd.Series(data=[1,2,3,4,5],index=["a","b","c","d","e"])
s2 = pd.Series(data=[10,20,30,40,50],index=["a","b","c","d","f"])
s3 = pd.Series(data=["a","b","a","d","f"],index=["a","b","c","d","f"])
data=pd.DataFrame({"c1":s1,"c2":s2,"c3":s3})
data.loc[data["c3"]=="a","c2"]=5
data

    c1    c2   c3
a  1.0   5.0    a
b  2.0  20.0    b
c  3.0   5.0    a
d  4.0  40.0    d
e  5.0   NaN  NaN
f  NaN  50.0    f

In [12]:
data.rename(columns={"c1":"column"})
data

    c1    c2   c3
a  1.0   5.0    a
b  2.0  20.0    b
c  3.0   5.0    a
d  4.0  40.0    d
e  5.0   NaN  NaN
f  NaN  50.0    f

In [13]:
del data["c3"]
data

    c1    c2
a  1.0   5.0
b  2.0  20.0
c  3.0   5.0
d  4.0  40.0
e  5.0   NaN
f  NaN  50.0